app/controllers/stocks_controller.rb

  def index
    unless params[:low] && params[:high]
      @stocks = Stock.all
---
SELECT min("stocks".price) AS min_price FROM "stocks"
SELECT price FROM "stocks" ORDER BY price DESC LIMIT 1